app/controllers/hotdogs_controller.rb

SELECT "hotdogs".* FROM "hotdogs"
---
    def index
        hotdogs = Hotdog.all

INSERT INTO "hotdogs" ("condiment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["condiment", "ketchup relish pickles"], ["user_id", 1], ["created_at", "2019-12-28 21:16:10.683667"], ["updated_at", "2019-12-28 21:16:10.683667"]]
---
      def create
        hotdog = Hotdog.create(hotdog_params)

SELECT "hotdogs".* FROM "hotdogs" WHERE "hotdogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hotdogs" WHERE "hotdogs"."id" = ?  [["id", 1]]
---
      def destroy
        data = {message: "Hotdog has been deleted"}
        hotdog = Hotdog.find(params[:id])
        hotdog.delete()