app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Olivier"], ["created_at", "2019-12-29 00:13:39.439927"], ["updated_at", "2019-12-29 00:13:39.439927"]]

    def destroy
        data = {message: "User has been deleted"}
        user = User.find(params[:id])
        user.delete()
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 69]]